objective_manager_api/app/models/objective.rb

  def objective_total_weight
    Objective.where.not(id: id).pluck(:weight).sum + weight
---
SELECT "objectives"."weight" FROM "objectives"