objective_manager_api/app/controllers/objectives_controller.rb

  def index
    @objectives = Objective.all
---
SELECT "objectives".* FROM "objectives"

  def create
    @objective = Objective.new(objective_params)

    if @objective.save
---
INSERT INTO "objectives" ("title", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Undefined objective"], ["weight", 0], ["created_at", "2022-02-21 09:08:09.304280"], ["updated_at", "2022-02-21 09:08:09.304280"]]

  def update
    if @objective.update(objective_params)
---
UPDATE "objectives" SET "title" = $1, "updated_at" = $2 WHERE "objectives"."id" = $3  [["title", "A new Title"], ["updated_at", "2022-02-21 10:31:37.993455"], ["id", 3]]

  def destroy
    @objective.destroy
---
DELETE FROM "objectives" WHERE "objectives"."id" = $1  [["id", 3]]

    def set_objective
      @objective = Objective.find(params[:id])
---
SELECT "objectives".* FROM "objectives" WHERE "objectives"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]